# Taps
tap "bufbuild/buf"
tap "fsouza/prettierd"
tap "homebrew/services"
tap "ktr0731/evans"
tap "oven-sh/bun"

# CLI tools
brew "awscli"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "go"
brew "jq"
brew "lazygit"
brew "mise"
brew "neovim", args: ["HEAD"]
brew "pam-reattach"
brew "pnpm"
brew "pre-commit"
brew "ripgrep"
brew "starship"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "watch"
brew "yarn"
brew "zoxide"

# Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"

# Language tools
brew "lua-language-server"
brew "bufbuild/buf/buf"
brew "fsouza/prettierd/prettierd"
brew "ktr0731/evans/evans"
brew "protobuf"
brew "protolint"

# Runtimes
brew "oven-sh/bun/bun"
brew "node"
brew "node-build"
brew "ruby-build"

# Services
brew "redis"

# Libraries (explicit dependencies)
brew "ffmpeg"
brew "vips"

# Apps
cask "alacritty"
cask "cursor"
cask "gcloud-cli"
cask "gitify"
cask "macskk"
cask "rubymine"
cask "visual-studio-code"

# VSCode extensions
vscode "apollographql.vscode-apollo"
vscode "bradgashler.htmltagwrap"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hediet.vscode-drawio"
vscode "mquandalle.graphql"
vscode "mrworkman.papercolor-vscode-redux"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "rooveterinaryinc.roo-cline"
vscode "rozbo.papercolor-vscode"
vscode "shopify.ruby-lsp"
vscode "styled-components.vscode-styled-components"
vscode "vscodevim.vim"
vscode "wallabyjs.console-ninja"

# Go tools
go "golang.org/x/tools/gopls"
go "github.com/pseudomuto/protoc-gen-doc/cmd/protoc-gen-doc"
go "honnef.co/go/tools/cmd/staticcheck"

# Cargo tools
cargo "tree-sitter-cli"
